# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# System and Terminal Utilities
brew "bat"           # Better cat
brew "colordiff"     # Colorized diff
brew "eza"           # Modern ls replacement
brew "fd"            # Better find
brew "fzf"          # Fuzzy finder
brew "htop"         # Process viewer
brew "ripgrep"      # Better grep
brew "tree"         # Directory listing
brew "wget"         # File downloader
brew "xz"           # Compression utility
brew "zstd"         # Fast compression

# Version Control
brew "git"          # Version control
brew "git-lfs"      # Git large file storage
brew "libgit2"      # Git core methods

# Development Languages and Platforms
brew "go"           # Go language
brew "node"         # Node.js
brew "python@3.12"  # Python

# Development Tools
brew "act"          # Run GitHub Actions locally
brew "buf"          # Protocol buffer toolkit
brew "cmake"        # Build system
brew "doctl"        # DigitalOcean CLI
brew "helm"         # Kubernetes package manager
brew "shellcheck"   # Shell script analysis
brew "tailscale"    # VPN client

# Build Dependencies
brew "autoconf"
brew "automake"
brew "gcc"
brew "libtool"
brew "llvm"
brew "m4"
brew "make"
brew "pkg-config"

# Image Processing
brew "imagemagick"  # Image manipulation
brew "vips"         # Image processing
brew "webp"         # Image format

# Security Tools
brew "gnupg"        # OpenPGP implementation
brew "openssl@3"    # SSL/TLS toolkit
brew "pinentry"     # PIN entry dialog

# Database and Data Tools
brew "sqlite"       # SQL database engine
brew "protobuf"     # Protocol buffers

# Applications
cask "headlamp"     # Kubernetes UI
cask "latest"       # Software update checker
cask "ollamac"      # Local LLM runner
cask "iterm2"       # Terminal emulator
cask "visual-studio-code"  # Code editor
cask "docker"       # Containerization 